Repository: BinaryAlley/Lumina
Catalog: src/Lumina.Presentation.Web/Resources/Views/Library/Management/Item.*.resx
Languages: ro_ro

source: Academic Paper
ro_ro: Lucrare Academică

source: Add directory
ro_ro: Adaugă dosar

source: Add New Library
ro_ro: Adaugă Librărie Nouă

source: Audio Book
ro_ro: Carte Audio

source: Audio Content
ro_ro: Conținut Audio

source: Back To Libraries
ro_ro: Înapoi La Biblioteci

source: Book
ro_ro: Carte

source: Book Series
ro_ro: Serie de Cărți

source: Comic Book
ro_ro: Bandă Desenată

source: Comic Series
ro_ro: Serie de Benzi Desenate

source: Cover
ro_ro: Preluare

# DescriptionDirectories
source: Select the folders containing the media files of this library
ro_ro: Selectează dosarele care conțin fișierele media ale acestei biblioteci

# DescriptionLibraryType
source: Select the type of media content this library will contain
ro_ro: Selectează tipul de conținut media pe care îl va conține această bibliotecă

# DescriptionTitle
source: A name to identify this library
ro_ro: Un nume pentru identificarea acestei biblioteci

source: Directories
ro_ro: Dosare

source: Documentary
ro_ro: Documentar

source: E Book
ro_ro: Carte Electronică

source: Edit Library
ro_ro: Editează Bibliotecă

source: Film Franchise
ro_ro: Franciză de Film

source: Film Series
ro_ro: Serie de Filme

source: General Information
ro_ro: Informații Generale

source: Graphic Novel
ro_ro: Roman Grafic

source: Interview
ro_ro: Interviu

source: Library Saved
ro_ro: Biblioteca A Fost Salvată

source: Library Type
ro_ro: Tip Bibliotecă

source: Live Performance
ro_ro: Spectacol Live

source: Magazine
ro_ro: Revistă

source: Miscellaneous Content
ro_ro: Conținut Divers

source: Movie
ro_ro: Film

source: Music
ro_ro: Muzică

source: Other
ro_ro: Altceva

source: Photo Album
ro_ro: Album Foto

source: Radio Show
ro_ro: Emisiune Radio

source: Remove
ro_ro: Șterge

source: Save
ro_ro: Salvează

source: Screenplay
ro_ro: Scenariu

source: Sheet Music
ro_ro: Partitură Muzicală

source: Sound Effect
ro_ro: Efect Sonor

source: Title
ro_ro: Titlu

source: Tv Show
ro_ro: Serial TV

source: Video Content
ro_ro: Conținut Video

source: Visual Content
ro_ro: Conținut Vizual

source: Written Content
ro_ro: Conținut Scris
